In [36]:
import pandas as pd

# Cargar el archivo CSV
df = pd.read_csv("D:\\SoyHenry\\Proyecto integrador\\data\\sales.csv")  # Usamos "\\" para evitar problemas de escape en la ruta

# Vista previa
df.head()

,SalesID,SalesPersonID,CustomerID,ProductID,Quantity,Discount,TotalPrice,SalesDate,TransactionNumber
0,1,6,27039,381,7,0.0,0.0,2018-02-05 07:38:25.430,FQL4S94E4ME1EZFTG42G
1,2,16,25011,61,7,0.0,0.0,2018-02-02 16:03:31.150,12UGLX40DJ1A5DTFBHB8
2,3,13,94024,23,24,0.0,0.0,2018-05-03 19:31:56.880,5DT8RCPL87KI5EORO7B0
3,4,8,73966,176,19,0.2,0.0,2018-04-07 14:43:55.420,R3DR9MLD5NR76VO17ULE
4,5,10,32653,310,9,0.0,0.0,2018-02-12 15:37:03.940,4BGS0Z5OMAZ8NDAFHHP3

In [37]:
# Visualizamos las columnas del DataFrame
df.columns

Index(['SalesID', 'SalesPersonID', 'CustomerID', 'ProductID', 'Quantity',
       'Discount', 'TotalPrice', 'SalesDate', 'TransactionNumber'],
      dtype='object')

In [38]:
# Información general del DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6758125 entries, 0 to 6758124
Data columns (total 9 columns):
 #   Column             Dtype
---  ------             -----
 0   SalesID            int64
 1   SalesPersonID      int64
 2   CustomerID         int64
 3   ProductID          int64
 4   Quantity           int64
 5   Discount           float64
 6   TotalPrice         float64
 7   SalesDate          object
 8   TransactionNumber  object
dtypes: float64(2), int64(5), object(2)
memory usage: 464.0+ MB

In [39]:
# Verificacion de filas con valores nulos en las columnas
df.isnull().sum()

SalesID                  0
SalesPersonID            0
CustomerID               0
ProductID                0
Quantity                 0
Discount                 0
TotalPrice               0
SalesDate            67526
TransactionNumber        0
dtype: int64

In [40]:
# Visualización de las primeras filas del DataFrame
pd.set_option('display.max_columns', None)
df.head()

,SalesID,SalesPersonID,CustomerID,ProductID,Quantity,Discount,TotalPrice,SalesDate,TransactionNumber
0,1,6,27039,381,7,0.0,0.0,2018-02-05 07:38:25.430,FQL4S94E4ME1EZFTG42G
1,2,16,25011,61,7,0.0,0.0,2018-02-02 16:03:31.150,12UGLX40DJ1A5DTFBHB8
2,3,13,94024,23,24,0.0,0.0,2018-05-03 19:31:56.880,5DT8RCPL87KI5EORO7B0
3,4,8,73966,176,19,0.2,0.0,2018-04-07 14:43:55.420,R3DR9MLD5NR76VO17ULE
4,5,10,32653,310,9,0.0,0.0,2018-02-12 15:37:03.940,4BGS0Z5OMAZ8NDAFHHP3

In [41]:
df[df['SalesDate'].isnull()].head(10) # - Explorar los registros sin SalesDate: vemos si hay algún patrón o si parecen errores sistemáticos.

,SalesID,SalesPersonID,CustomerID,ProductID,Quantity,Discount,TotalPrice,SalesDate,TransactionNumber
50,51,21,12478,215,4,0.2,0.0,NaN,H8B08JBXS1TOWBJH3XMS
227,228,18,70321,74,18,0.0,0.0,NaN,SJ5VWMCZHIC2XBUEHEZJ
295,296,21,71322,219,19,0.0,0.0,NaN,8IXG8EPHL6LSLY3264G9
347,348,9,92737,352,24,0.0,0.0,NaN,HXGMYR6J7HWJUOTKB19Q
355,356,18,48857,278,13,0.0,0.0,NaN,0KLH8NGRQAGYRCVM4IF8
362,363,18,77154,133,20,0.1,0.0,NaN,FQUXHKQGNRYKRCU50IWY
480,481,1,43991,23,12,0.2,0.0,NaN,R8H5HEWDNSXXGYQ9XL3H
502,503,23,27217,331,7,0.0,0.0,NaN,6G0DTZL5Y4NAP1GNAUG8
578,579,23,54690,415,14,0.0,0.0,NaN,C5CJL7I4JMNKHG2X557Q
692,693,1,86443,308,22,0.0,0.0,NaN,4IZML962H01TJ42Q3GK3

In [ ]:
# Intentar convertir a el dtype de SalesDate a datetime
df['SalesDate'] = pd.to_datetime(df['SalesDate'], errors='coerce')

In [43]:
df['SalesDate'].isnull().sum()

67526

In [44]:
df[df['SalesDate'].isnull()].head()

,SalesID,SalesPersonID,CustomerID,ProductID,Quantity,Discount,TotalPrice,SalesDate,TransactionNumber
50,51,21,12478,215,4,0.2,0.0,NaT,H8B08JBXS1TOWBJH3XMS
227,228,18,70321,74,18,0.0,0.0,NaT,SJ5VWMCZHIC2XBUEHEZJ
295,296,21,71322,219,19,0.0,0.0,NaT,8IXG8EPHL6LSLY3264G9
347,348,9,92737,352,24,0.0,0.0,NaT,HXGMYR6J7HWJUOTKB19Q
355,356,18,48857,278,13,0.0,0.0,NaT,0KLH8NGRQAGYRCVM4IF8

In [ ]:
# Verificamos nuevamente los tipos de datos de las columnas
df.dtypes

SalesID                       int64
SalesPersonID                 int64
CustomerID                    int64
ProductID                     int64
Quantity                      int64
Discount                    float64
TotalPrice                  float64
SalesDate            datetime64[ns]
TransactionNumber            object
dtype: object

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6758125 entries, 0 to 6758124
Data columns (total 9 columns):
 #   Column             Dtype
---  ------             -----
 0   SalesID            int64
 1   SalesPersonID      int64
 2   CustomerID         int64
 3   ProductID          int64
 4   Quantity           int64
 5   Discount           float64
 6   TotalPrice         float64
 7   SalesDate          datetime64[ns]
 8   TransactionNumber  object
dtypes: datetime64[ns](1), float64(2), int64(5), object(1)
memory usage: 464.0+ MB

### Jugamos con el df a ver que otras cosas podemos averiguar

In [ ]:
# Verificar si hay filas duplicadas
df.duplicated().sum()

0

In [65]:
# Verificamos las veces que aparece cada ID, incluyendo los NaN. Las ordenamos por el índice, que en este caso es el número de SalesPersonID.
df['SalesPersonID'].value_counts(dropna=False).sort_index()

SalesPersonID
1     293394
2     293737
3     293175
4     294744
5     293711
6     293973
7     293967
8     294449
9     294180
10    293888
11    294110
12    293164
13    293530
14    294035
15    294096
16    293685
17    292521
18    294419
19    293875
20    293562
21    294983
22    293224
23    293703
Name: count, dtype: int64

In [49]:
df['CustomerID'].nunique()

98759

In [51]:
sin_fecha = df[df['SalesDate'].isnull()]

In [52]:
print(sin_fecha.shape)  # Verificar cuántas filas no tienen fecha

(67526, 9)

In [53]:
67526 / df.shape[0] * 100

0.999182465550726

In [54]:
sin_fecha[['ProductID', 'Quantity', 'TotalPrice']].isnull().sum()

ProductID     0
Quantity      0
TotalPrice    0
dtype: int64

In [55]:
sin_fecha[['Quantity', 'TotalPrice']].describe()

           Quantity  TotalPrice
count  67526.000000     67526.0
mean      13.019592         0.0
std        7.181422         0.0
min        1.000000         0.0
25%        7.000000         0.0
50%       13.000000         0.0
75%       19.000000         0.0
max       25.000000         0.0

In [ ]:
# ¿Son ventas de productos reales? Revisamos si todas las ProductID existen en la tabla de products. Ver las más frecuentes:
sin_fecha['ProductID'].value_counts().head(10)

ProductID
162    183
264    181
22     181
93     180
333    179
192    179
374    178
166    176
285    175
251    175
Name: count, dtype: int64

In [ ]:
# ¿Están asociadas a vendedores específicos? A veces los datos incompletos provienen de una fuente en particular. Revisamos los IDs de vendedor más frecuentes.
sin_fecha['SalesPersonID'].value_counts().head(24).sort_index()

SalesPersonID
1     2916
2     3015
3     2834
4     2977
5     2982
6     2911
7     2930
8     2904
9     2924
10    2845
11    2879
12    2916
13    2897
14    3099
15    3024
16    2992
17    3029
18    2792
19    2999
20    2893
21    2959
22    2963
23    2846
Name: count, dtype: int64

In [ ]:
# ¿Qué rango de TransactionNumber tienen? Esto nos puede decir si son viejas o recientes.
sin_fecha['TransactionNumber'].describe()

count                    67526
unique                   67526
top       H8B08JBXS1TOWBJH3XMS
freq                         1
Name: TransactionNumber, dtype: object

In [ ]:
# Las comparamos con ventas que sí tienen fecha:
con_fecha = df[df['SalesDate'].notnull()]
con_fecha['TransactionNumber'].describe()

count                  6690599
unique                 6690599
top       FQL4S94E4ME1EZFTG42G
freq                         1
Name: TransactionNumber, dtype: object

In [ ]:
# Guardamos el DataFrame limpio como nuevo archivo CSV
df.to_csv("D:/SoyHenry/Proyecto integrador/data/sales_cleaned.csv", index=False)